import { useTranslation } from 'react-i18next';

interface IMainInfoProps {
	refs: any;
}

const MainInfo = ({ refs }: IMainInfoProps): JSX.Element => {
	const { t } = useTranslation();
	return (
		<section className="flex flex-col gap-8 pl-80">
			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div ref={refs.naxabanRef}>
				<h3>{t('Ուրիշ Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>

			<div>
				<h3>{t('Նախաբան')}</h3>
				<hr />

				<p>
					{t(
						'js-turtle֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n' +
							'Turtle-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո hanumanum ֊ը ֆորքել և զարգացրել է այն։',
					)}
				</p>
			</div>
		</section>
	);
};

export default MainInfo;
