{
  "Նախաբան": "Intro",
  "tumo-js֊ը հատուկ միջավայր է JavaScript լեզվով ծրագրավորում սովորելու/ուսուցանելու համար։ Սկզբնական գաղափարը պատկանում է Սեյմուր Պեյպերտին.\n Tumo-ի այս JavaScript տարբերակի սկիզբը դրել է  bjpop֊ը, հետո Թումոյի ծրագրավորման դասընթացավարների թիմը զարգացրել է այն։": "tumo-js is a special environment for learning/teaching JavaScript programming. Original idea by Seymour Papert.\n This JavaScript version of Tumo was started by bjpop, then developed by Tumo's team of programming trainers.",
  "tumo.js Ուղեցույց": "tumo.js Introduction",
  "Գրել և աշխատացնել կոդ": "Write and Run code",
  "Տերմիններ": "Terms",
  "Հիմնական ֆունկցիաներ": "Basic Functions",
  "Ինչպես գրել և աշխատացնել ծրագրերը": "How to write and run programs",
  "Ծրագիրը աշխատացնելու համար ընդամենը անհրաժեշտ է HTML ֆայլում կցել CDN հղումը։": "All you need to do to run the program is attach the CDN link in the HTML file.",
  "Tumo.js տերմիններ": "Tumo.js Terms",
  "վրձին": "brush",
  "- դեղին եռանկյունը": "- yellow triangle",
  "կտավ": "canvas",
  "- տարածքը, որտեղ շարժվում է վրձինը": "- the area where the brush moves",
  "կոորդինատներ": "coordinates",
  "- կետի կոորդինատները կտավի վրա արտահայտված են x-ով և y-ով": "- point in canvas, in x and y",
  "Արգումենտներ": "Arguments",
  "Օրինակ՝": "Example:",
  "Օրինակ 1՝": "Example 1:",
  "Օրինակ 2՝": "Example 2:",
  "Օրինակ 1 (գույնի անունով)՝": "Example 1 (color name):",
  "Օրինակ 2 (RGB)՝": "Example 2 (RGB):",
  "Օրինակ 3 (HEX)՝": "Example 3 (HEX):",
  "Օրինակ 4 (զանգածով RGB)՝": "Example 4 (array RGB):",
  "Արդյունք՝": "Result:",
  "drawLine արտահայտությունը անգլերենից թարգմանաբար նշանակում է «նկարել գիծ»։ Այս ֆունկցիան վրձինը մղում է առաջ՝ տրված քայլերի քանակով։ Այսինքն, եթե փակագծերի մեջ գրաված է 100, ապա վրձինը 100 միավոր առաջ կշարժվի։": "The phrase drawLine means \"draw a line\". This function advances the brush by the given number of steps. That is, if 100 is enclosed in brackets, the brush will move forward 100 points.",
  "Left բառն անգլերենից թարգմանաբար նշանակում է ձախ։ Վրձինը ուղղությունը պտտում է տրված աստիճանով դեպի ձախ։ Եթե փակագծերի մեջ գրանք 30, ապա վրձինը 30 աստիճանով ձախ կթեքվի։": "The brush rotates the direction to the left by the given degree. If we write 30 in the brackets, the brush will turn left by 30 degrees.",
  "Ամեն ինչն ինչպես left()-ի ժամանակ, սակայն դեպի աջ :)": "Same as in left but to right :)",
  "Width բառը թարգմանաբար նշանակում է լայնություն․ width() ֆունկցիան կարգավորում է հաջորդող գծերի լայնությունը։": "Sets line thickness",
  "color() ֆունկցիան որոշում է հաջորդող գծերի գույնը:": "Sets color of next lines",
  "string: a (գույնի անունը)": "string: a (color name)",
  "string: a (գույնի hex կոդը)": "string: a (color hexcode)",
  "Տեղափոխում է կրիան x,y կորդինատները ունեցող կետ, սակայն տեղափոխման ընթացքում գիծ չի գծում։": "Move to x,y coordinates without drawing a line",
  "Տեղաշարժում է վրձինը նշված հեռավորության վրա, առանց գիծ գծելու։": "Moves the brush the specified distance without drawing a line.",
  "Մաքրում է կտավը": "Clear all canvas.",
  "չունի": "none",
  "Ցուցադրում է կոորդինատական առանցքները։ Արգումենտը կարգավորում է ցանցի խտությունը։": "Shows Euclidean grid on canvas. We recomend call this function before all others. Argument sets grid scale.",
  "Պատկերներ": "Shapes",
  "Գծում է եռանկյուն։ Արգումենտը որոշում է եռանկյան կողմի երկարությունը։": "Draws a triangle. The argument determines the length of the side of the triangle.",
  "Գծում է ուղղանկյուն Արգումենտները որոշում են ուղղանկյան կողմերի երկարությունները։": "Draws a rectangle. The arguments determine the lengths of the sides of the rectangle.",
  "Գծում է բազմանկյուն: Արգումենտները որոշում են բազմանկյան կողմերի քանակը և երկարությունը։": "Draws a polygon. The arguments determine the number and length of the sides of the polygon."
}
